Documents/ПланПотребностиСпецОдежды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ПланПотребностиСпецОдежды</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПотребностьСпецОдежды</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Список</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТРУ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокСлужбы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПланПотребностиСпецОдежды/Forms/ФормаДокументаУправляемая/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(Объект, ОбщегоНазначенияБКВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета());
		РаботаСДиалогами.УстановитьЗаголовокФормыДокумента("", Объект.Ссылка, ЭтаФорма);
		Объект.Дата = ТекущаяДата();
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИзДругогоУчастка(Команда)
	
	Если Объект.Список.Количество() > 0 Тогда
		
		ФмВыб = ПолучитьФорму("Документ.ПланПотребностиСпецОдежды.Форма.ВыборПодразделенияИДолжности");
		ФмВыб.Должность = ДолжностьДругогоУчастка;
		ФмВыб.Подразделение = ПодразделениеДругогоУчастка;
		Рез = ФмВыб.ОткрытьМодально();
		Если Рез=Неопределено Тогда
			Возврат;
		КонецЕсли;
		ДолжностьДругогоУчастка = Рез.Должность;
		ПодразделениеДругогоУчастка = Рез.Подразделение;
		
		Если ПодразделениеДругогоУчастка.Пустая() Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Поле = "ПодразделениеДругогоУчастка";
			Сообщение.Текст = "Укажите подразделение!";
			Сообщение.Сообщить();
			Возврат;
		КонецЕсли;
		
		Если ДолжностьДругогоУчастка.Пустая() Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Поле = "ДолжностьДругогоУчастка";
			Сообщение.Текст = "Укажите должность!";
			Сообщение.Сообщить();
			Возврат;
		КонецЕсли;
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ПослеПодтвержденияПерезаполнитьТабличнуюЧасть", ЭтотОбъект), "Табличная часть будет очищена, продолжить?", РежимДиалогаВопрос.ДаНет, 10, КодВозвратаДиалога.Нет, "Внимание!", КодВозвратаДиалога.Нет);
	Иначе
		
		Если ПодразделениеДругогоУчастка.Пустая() Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Поле = "ПодразделениеДругогоУчастка";
			Сообщение.Текст = "Укажите подразделение!";
			Сообщение.Сообщить();
			Возврат;
		КонецЕсли;
		
		Если ДолжностьДругогоУчастка.Пустая() Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Поле = "ДолжностьДругогоУчастка";
			Сообщение.Текст = "Укажите должность!";
			Сообщение.Сообщить();
			Возврат;
		КонецЕсли;
		
		ЗаполнитьИзДругогоУчасткаНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПодтвержденияПерезаполнитьТабличнуюЧасть(Результат, Параметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаполнитьИзДругогоУчасткаНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИзДругогоУчасткаНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", КонецДня(?(Объект.Ссылка.Пустая(), ТекущаяДата(), Объект.Дата)));
	Запрос.УстановитьПараметр("Регистратор", Объект.Ссылка);
	Запрос.УстановитьПараметр("Должность", ДолжностьДругогоУчастка);
	Запрос.УстановитьПараметр("Подразделение", ПодразделениеДругогоУчастка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПотребностьСпецОдеждыСрезПоследних.ТРУ КАК ТРУ,
	|	ПотребностьСпецОдеждыСрезПоследних.Количество,
	|	ПотребностьСпецОдеждыСрезПоследних.СрокСлужбы
	|ИЗ
	|	РегистрСведений.ПотребностьСпецОдежды.СрезПоследних(
	|			&Дата,
	|			Регистратор <> &Регистратор
	|				И Должность = &Должность
	|				И Подразделение = &Подразделение) КАК ПотребностьСпецОдеждыСрезПоследних
	|ГДЕ
	|	(НЕ ПотребностьСпецОдеждыСрезПоследних.Количество = 0)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТРУ
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Объект.Список.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаНачатьЗаполнение(Команда)
	
	Элементы.ГруппаРеквизитыЗаполнения.Видимость = Истина;
	Элементы.КомандаНачатьЗаполнение.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьКод();	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриИзменении(Элемент)
	//ЗаполнитьКод();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКод()
	
	Для каждого Строка Из Объект.Список Цикл
		 Строка.Код = Строка.Тру.Код;
	КонецЦикла; 	
	
КонецПроцедуры  


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ПередЗаписьюСервер();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюСервер()
	Объект.Автор = Пользователи.ТекущийПользователь();
КонецПроцедуры
